cask_args appdir: '/Applications'

# Tools
brew 'git'
brew 'httpie'
brew 'jq'
brew 'siege'
brew 'trash'
brew 'tree'
brew 'watch'
brew 'yarn'
brew 'heroku'

# Languages/Runtimes
brew 'go'
brew 'redis'
cask 'java'

# Databases
brew 'mongodb'
brew 'postgresql'
brew 'redis'
brew 'rethinkdb'
brew 'elasticsearch@1.7'

# Apps
cask 'alfred'
cask 'bee'
cask 'caffeine'πsp
cask 'tunnelblick'
cask '1password'
cask 'discord'
cask 'spotify'
cask 'dropbox'
cask 'moom'
cask 'sourcetree'
cask 'iterm2'
cask 'docker'
cask 'google-chrome'
cask 'mongohub'
cask 'postman'
cask 'sequel-pro'
cask 'screenhero'
cask 'slack'
cask 'visual-studio-code'

# Games
cask 'battle-net'
cask 'steam'
