cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'homebrew/services'

# Tools
brew 'elixir'
brew 'git'
brew 'gpg'
brew 'jq'
brew 'pinentry-mac'
brew 'python3'
brew 'shellcheck'
brew 'siege'
brew 'tree'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

# Mac App Store
# mas 'BetterSnapTool', id: 417375580
# mas 'Apple Configurator 2', id: 1037126344

# Apps
cask '1password'
cask 'boostnote'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'insomnia'
cask 'kitematic'
cask 'postman'
cask 'tableplus'
cask 'slack'
cask 'visual-studio-code'

# Games
cask 'battle-net'
cask 'league-of-legends'
cask 'minecraft'
cask 'steam'
cask 'twitch'
